* Rakefile

#+name:rakefile
#+begin_src ruby :tangle Rakefile :noweb yes
# coding:utf-8
# coding:utf-8
require 'date'
require 'rake/clean'

def myhome
  path = `pwd`.chomp.split("/").reverse
  depth = path.index("org")
  [depth+1, path[0..depth].reverse]
end

def org_sub_dir
  (Dir.glob("*/*.org").map do |f| File.dirname(f) end).uniq
end

if File.exist?("Rakefile.setup.rb")
  puts "loading Rakefile.setup.rb."
  load "./Rakefile.setup.rb"
else
  SUBDIRS = org_sub_dir
  EXCLUDES = FielList ["Makefile.org", "Rakefile.org", "log.org", "0*.org"]
  ORGS = FileList["*.org"] - EXCLUDES
  HTMLS = ORGS.ext(".html")
end

NOW = DateTime.now.to_s

puts "HTMLS: #{HTMLS}"
puts "SUBDIRS: #{SUBDIRS}"

CLEAN.include(FileList["*~","#*"])
CLOBBER.include(HTMLS)

# ORGS.each do |org|
#   html = File.basename(org, ".org")+".html"
#   puts "generating #{html} ... "
#   @depends = `org_dependency.rb #{org}`.chomp.split(", ")
#   puts "depends ", @depends.join(", ")
#   if @depends.size!=0 
#     file html => @depends.push(org) do |t|
#       sh "org2html #{org}"
#       deploy(t.name, "#{SITE}/#{DIR}")
#     end
#   end
# end

depth,path = myhome

MYHOME = "../"*depth
ORG = "#{MYHOME}org/"
SITE = "#{MYHOME}docs/"
path.shift
DIR = path.join("/")

def deploy(file, dir)
  p "deploying #{dir}#{file}"
  sh "mkdir -p #{dir}"
  File.open("#{dir}/#{file}", "w") do |target| 
    all = File.read(file).gsub("http:\/\/", "https:\/\/")
    all.gsub!("\/\/www.pirilampo.org", "\/\/masayuki054.github.io\/morioka_u_ict")
    all.gsub!("\/\/wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme", "\/\/masayuki054.github.io\/morioka_u_ict")    
    all.gsub!("https:\/\/vdeep.net", "http:\/\/vdeep.net")
    all.gsub!("https:\/\/typing.sakura.ne.jp", "http:\/\/typing.sakura.ne.jp")
    all.gsub!("\/\/orgmode.org\/mathjax\/MathJax.js", "\/\/cdn.mathjax.org\/mathjax\/latest\/MathJax.js?config=TeX-MML-AM_CHTML")
    target.write(all)
  end

  sh "git add #{dir}/#{file}"
  sh "git commit -m deploy_#{NOW} #{dir}/#{file}"

end

rule ".html" => ".org" do |t|
  sh "org2html #{t.prerequisites.join(' ')}"
  deploy(t.name, "#{SITE}/#{DIR}")
end

task :default => [:org2html]

task :org2html => HTMLS do
  puts "git push"
  sh "git push"
end

task :subdirs do
  org_sub_dir.each do |subdir|
    Dir.chdir(File.expand_path(subdir)) do
      puts `pwd`
      sh "rake"
    end
  end
end    

task :subdirs_install_rakefile do
  org_sub_dir.each do |subdir|
    Dir.chdir(subdir) do
      puts `pwd`
      sh "cp ../Rakefile.org ."
      sh "cp ../Rakefile ."
      sh "rake subdirs_install_rakefile"
    end
  end
end

#+end_src

#+BEGIN_SRC ruby :tangle Rakefile.setup.rb
EXCLUDES = [
  "Rakefile.org",
  "Makefile.org",
  "contents.org",
  "links.org",
  "log.org"
]

ORGS = [
  "index.org",
  "lect.org",
  "announce.org",
  "prepare.org",
  "guidance.org",
  "reference.org",
  "office.org",
  "pc.org",
  "s.org",
  "text.org",
  "typing.org",
  "windows.org",
]

SUBDIRS = [
  "articles",
]

HTMLS = ORGS.map do |f|
  File.basename(f,'.org')+".html"
end



#+END_SRC

#+BEGIN_SRC sh  :results output 
rake

#+END_SRC

#+RESULTS:
#+begin_example
loading Rakefile.setup.rb.
HTMLS: ["index.html", "lects.html", "ruby.html", "oo.html", "meta-ruby.html", "note.html", "emacs.html"]
SUBDIRS: ["info", "lects", "meta-ruby", "ruby", "emacs", "org-docs", "poker"]
generating index.html ... 
generating lects.html ... 
generating ruby.html ... 
generating oo.html ... 
generating meta-ruby.html ... 
generating note.html ... 
generating emacs.html ... 
git push
#+end_example

